InformationRegisters/бит_ГраницыЗапретаИзмененияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ГраницыЗапретаИзмененияДанных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГраницаЗапретаИзменений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_НастройкиПравДоступаПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиПравДоступаПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНаследованияПравДоступаИерархическихСправочников</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВнешниеОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьВнешниеОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОбъектовДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовДоступа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешниеОбработки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Подразделение</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФизическоеЛицо</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подготовлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяИБ</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПользователяСервиса</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвойстваПользователяИБ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/бит_УстановкаДатыЗапретаИзмененияДанныхУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОпределитьСпособУказанияДаты();
	ПриИзмененииСпособаУказания();	    
	
	ЗаполнитьДеревоДат();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 09.09.2016 11:55:28 Начало правки...
	Если ЗавершениеРаботы И Модифицированность Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:55:28 Конец правки.

	Если Модифицированность Тогда
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Отказ",Отказ);
		
		Оповещение = Новый ОписаниеОповещения("ВопросЗавершение", ЭтотОбъект,ДополнительныеПараметры);
		
		ПоказатьВопрос(Оповещение, "Данные были изменены. Сохранить изменения?", РежимДиалогаВопрос.ДаНет);	
		
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СпособУказанияДатыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.СписокСпособУказанияДаты.СписокВыбора.Очистить();
	Элементы.СписокСпособУказанияДаты.СписокВыбора.Добавить(1,"Общая дата",,);
	Элементы.СписокСпособУказанияДаты.СписокВыбора.Добавить(2,"По организациям",,);
	Элементы.СписокСпособУказанияДаты.СписокВыбора.Добавить(3,"По организациям и пользователям",,);
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("СпособУказанияДатыНачалоВыбораЗавершение", ЭтотОбъект), Элементы.СписокСпособУказанияДаты.СписокВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособУказанияДатыНачалоВыбораЗавершение(ВыбранныйЭлемент,ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		
		Возврат;
		
	КонецЕсли;	
	
	Если Строка(ВыбранныйЭлемент) = "Общая дата" Тогда
		
		СпособУказанияДатыНаСервере(1);
		
		
	ИначеЕсли Строка(ВыбранныйЭлемент) = "По организациям" Тогда
		
		СпособУказанияДатыНаСервере(2);
		
		
	ИначеЕсли Строка(ВыбранныйЭлемент) = "По организациям и пользователям" Тогда
		
		СпособУказанияДатыНаСервере(3);
		
	КонецЕсли;
	
	ПриИзмененииСпособаУказания();	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСпособУказанияДатыПриИзменении(Элемент)
	
	Если Элемент.ТекстРедактирования  = "Общая дата" Тогда
		СпособУказанияДаты = 1;
		
	ИначеЕсли Элемент.ТекстРедактирования  = "По организациям" Тогда
		
		СпособУказанияДаты = 2;
	ИначеЕсли Элемент.ТекстРедактирования  = "По организациям и пользователям" Тогда
		
		СпособУказанияДаты = 3;
		
	КонецЕсли;
	
	ПриИзмененииСпособаУказания();	
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура управляет визуальным поведением элементов формы в зависимости от реквизита "Способ указания даты".
//
&НаКлиенте
Процедура УстановитьВидимость()
	
	Если СпособУказанияДаты = 2 Тогда
		
		Элементы.ДатыПоОрганизациям.Видимость = Истина;
		Элементы.ОбщаяДата.Видимость = Ложь;
		Элементы.ДеревоДаты.Видимость = Истина;
		Элементы.ДеревоДаты.КоманднаяПанель.Видимость = Ложь;
		Элементы.ДеревоДаты.КоманднаяПанель.ПодчиненныеЭлементы.Добавить.Видимость = Ложь;
		
	ИначеЕсли СпособУказанияДаты = 3 Тогда
		
		Элементы.ДатыПоОрганизациям.Видимость = Истина;
		Элементы.ОбщаяДата.Видимость = Ложь;
		Элементы.ДеревоДаты.КоманднаяПанель.Видимость = Истина;
		Элементы.ДеревоДаты.КоманднаяПанель.ПодчиненныеЭлементы.Добавить.Видимость = Истина;
		
	КонецЕсли;                           
	
КонецПроцедуры // УстановитьВидимость

&НаСервере
Процедура СпособУказанияДатыНаСервере(ВыбранныйЭлемент)
	
	СпособУказанияДаты = ВыбранныйЭлемент;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияКомандФормы

&НаКлиенте
Процедура ДобавитьПользователя(Команда)
	
	// БИТ_ЖКХ 13.02.2015{{}}
	// КорневаяСтрока = Элементы.ДеревоДаты.ТекущаяСтрока;.
	КорневаяСтрока = Элементы.ДеревоДаты.ТекущиеДанные;
	// БИТ_ЖКХ 13.02.2015{{}}
	
	Если КорневаяСтрока = Неопределено Тогда
		// Если в табличном поле не выбрана строка.
		// Добавление в дерево невозможно.
		Возврат;
	КонецЕсли;
	
	Если НЕ КорневаяСтрока.ТипСтроки = 1 Тогда
		// Если выбрана строка на уровне пользователя или группы пользователей.
		// Новую строку добавляем в ту же ветку дерева.
		КорневаяСтрока = КорневаяСтрока.Родитель;
	КонецЕсли;    
	
	ДобавитьСтрокуДерева(3, КорневаяСтрока, "ДеревоДаты" , "ОрганизацияПользователь");
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуПользователей(Команда)
	
	// БИТ_ЖКХ 13.02.2015{{
	// КорневаяСтрока = Элементы.ДеревоДаты.ТекущаяСтрока;.
	КорневаяСтрока = Элементы.ДеревоДаты.ТекущиеДанные;
	// БИТ_ЖКХ 13.02.2015}}
	
	Если КорневаяСтрока = Неопределено Тогда
		// Если в табличном поле не выбрана строка.
		// Добавление в дерево невозможно.
		Возврат;
	КонецЕсли;
	Если НЕ КорневаяСтрока.ТипСтроки = 1 Тогда
		// Если выбрана строка на уровне пользователя или группы пользователей.
		// Новую строку добавляем в ту же ветку дерева.
		КорневаяСтрока = КорневаяСтрока.Родитель;
	КонецЕсли;    
	
	ДобавитьСтрокуДерева(2, КорневаяСтрока, "ДеревоДаты", "ОрганизацияПользователь");
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтроку(Команда)
	
	ТекущаяСтрока = Элементы.ДеревоДаты.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ТекущаяСтрока.ПравоНаИзменение тогда
		СтрокаОрганизации = ?(ТекущаяСтрока.Уровень() = 0, ТекущаяСтрока, ТекущаяСтрока.Родитель);

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("У Вас нет права на удаление данных по организации " + СокрЛП(СтрокаОрганизации.ОрганизацияПользователь.Наименование));
		
		Возврат;
	КонецЕсли;	                           
	
	Если ТекущаяСтрока.Уровень() = 0 Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Удаление организации невозможно. Вы можете удалить пользователя или группу пользователей.");
		
		Возврат;        
	КонецЕсли;
	
	ТекущаяСтрока.Родитель.Строки.Удалить(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	Отказ = Ложь;
	СохранитьДанные(Отказ);
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// БИТ_ЖКХ 09.02.2015{{
&НаКлиенте
Процедура ВопросЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		СохранитьДанные(ДополнительныеПараметры.Отказ);
	КонецЕсли;	
	
КонецПроцедуры
// БИТ_ЖКХ 09.02.2015}}

// Процедура - определяет способ указания даты, примененный ранее.
//
&НаСервере
Процедура ОпределитьСпособУказанияДаты()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ РАЗРЕШЕННЫЕ
	|	ГраницыЗапретаИзмененияДанных.ГраницаЗапретаИзменений КАК ДатаЗапрета
	|ИЗ
	|	РегистрСведений.бит_ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных";
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗапроса.Количество() = 0 Тогда
		СпособУказанияДаты = 1;
		ОбщаяДатаЗапрета = Дата('00010101');
	ИначеЕСли ТаблицаЗапроса.Количество() = 1 Тогда
		СпособУказанияДаты = 1;
		ОбщаяДатаЗапрета = ТаблицаЗапроса[0].ДатаЗапрета;
	Иначе		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Организации.Ссылка,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(ГраницыЗапрета.ГраницаЗапретаИзменений, ДАТАВРЕМЯ(1, 1, 1)))
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГраницыЗапретаИзмененияДанных КАК ГраницыЗапрета
		|		ПО ГраницыЗапрета.Организация = Организации.Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Организации.Ссылка
		|ИМЕЮЩИЕ КОЛИЧЕСТВО (РАЗЛИЧНЫЕ ЕСТЬNULL(ГраницыЗапрета.ГраницаЗапретаИзменений, ДАТАВРЕМЯ(01,01,01))) > 1";
		
		Результат = Запрос.Выполнить();
		СпособУказанияДаты = 2 + Число(НЕ Результат.Пустой());		
	КонецЕсли;		
	
КонецПроцедуры // ОпределитьСпособУказанияДаты

// Процедура управляет отображением страниц и первоначальным заполнением деревьев дат.
// Вызывается при обработке события "ПриИзменении" элемента "СпособУказанияДаты".
//
&НаКлиенте
Процедура ПриИзмененииСпособаУказания()
	
	Если СпособУказанияДаты = 1 Тогда
		Элементы.ОбщаяДата.Видимость = Истина;
		Элементы.ДеревоДаты.Видимость = Ложь;
		
	Иначе
		
		Элементы.ОбщаяДата.Видимость = Ложь;
		Элементы.ДеревоДаты.Видимость = Истина;
		
		УстановитьВидимость();
		
	КонецЕсли;    
	
КонецПроцедуры // ПриИзмененииСпособаУказания

// Процедура выполняет запись данных в регистр сведений "Границы запрета изменения данных".
//
&НаСервере
Процедура СохранитьДанные(Отказ = Неопределено)
	
	ДеревоЗначений = ДанныеФормыВЗначение(ДеревоДаты,тип("ДеревоЗначений"));
	
	Попытка
		УстановитьМонопольныйРежим(Истина);
	Исключение

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Установка даты запрета изменения данных должна выполняться в монопольном режиме.");
		
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Если СпособУказанияДаты = 1 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст  = "ВЫБРАТЬ // РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация,
		|	НЕОПРЕДЕЛЕНО КАК Пользователь,
		|	&ОбщаяДата КАК ГраницаЗапретаИзменений
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
		//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
		Если Не РольДоступна("ПолныеПрава") Тогда			
			Запрос.Текст = Запрос.Текст + "
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
			|ПО Организации.Ссылка = НастройкиПравДоступаПользователей.ОбъектДоступа
			|	И (НастройкиПравДоступаПользователей.ВидОбъектаДоступа = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОбъектовДоступа.Организации))
			|	И (НастройкиПравДоступаПользователей.Пользователь В	
			|				(ВЫБРАТЬ
			|					Справочник.ГруппыПользователей.ПользователиГруппы.Ссылка
			|				ИЗ
			|					Справочник.ГруппыПользователей.ПользователиГруппы
			|				ГДЕ
			|					Справочник.ГруппыПользователей.ПользователиГруппы.Пользователь = &ТекущийПользователь))			
			|	И (НастройкиПравДоступаПользователей.Запись = ИСТИНА)";
			
			Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОбщаяДата", ОбщаяДатаЗапрета);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Набор = РегистрыСведений.бит_ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
			Набор.Отбор.Организация.Установить(Выборка.Организация);
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Набор.Записать();
		КонецЦикла;
		
	ИначеЕсли СпособУказанияДаты = 2 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст  = "ВЫБРАТЬ// РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация,
		|	НЕОПРЕДЕЛЕНО КАК Пользователь
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
		//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
		Если Не РольДоступна("ПолныеПрава") Тогда
			
			Запрос.Текст = Запрос.Текст + "
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
			|ПО Организации.Ссылка = НастройкиПравДоступаПользователей.ОбъектДоступа
			|	И (НастройкиПравДоступаПользователей.ВидОбъектаДоступа = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОбъектовДоступа.Организации))
			|	И (НастройкиПравДоступаПользователей.Пользователь В	
			|				(ВЫБРАТЬ
			|					Справочник.ГруппыПользователей.ПользователиГруппы.Ссылка
			|				ИЗ
			|					Справочник.ГруппыПользователей.ПользователиГруппы
			|				ГДЕ
			|					Справочник.ГруппыПользователей.ПользователиГруппы.Пользователь = &ТекущийПользователь))
			|	И (НастройкиПравДоступаПользователей.Запись = ИСТИНА)";
			
			Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
			
		КонецЕсли;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НаборЗаписей  = РегистрыСведений.бит_ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Организация.Установить(Выборка.Организация);
			
			Запись = НаборЗаписей.Добавить();
			Запись.Организация = Выборка.Организация;
			Запись.Пользователь = Выборка.Пользователь;
			Запись.ГраницаЗапретаИзменений = Дата('00010101');
			
			// БИТ_ЖКХ 13.02.2015{{
			// СтрокаВДереве = ДеревоДаты.Строки.Найти(Выборка.Организация, "ОрганизацияПользователь");.
			СтрокаВДереве = ДеревоЗначений.Строки.Найти(Выборка.Организация, "ОрганизацияПользователь");
			// БИТ_ЖКХ 13.02.2015}}
			
			Если СтрокаВДереве <> Неопределено Тогда
				Запись.ГраницаЗапретаИзменений = СтрокаВДереве.Граница;
			КонецЕсли;
			НаборЗаписей.Записать();
		КонецЦикла;
		
	ИначеЕсли СпособУказанияДаты = 3 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст  = "ВЫБРАТЬ //РАЗРЕШЕННЫЕ
		|	Организации.Ссылка КАК Организация
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
		//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
		Если Не РольДоступна("ПолныеПрава") Тогда
			Запрос.Текст = Запрос.Текст + "
			|ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
			|ПО Организации.Ссылка = НастройкиПравДоступаПользователей.ОбъектДоступа
			|	И (НастройкиПравДоступаПользователей.ВидОбъектаДоступа = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОбъектовДоступа.Организации))
			|	И (НастройкиПравДоступаПользователей.Пользователь В 
			|				(ВЫБРАТЬ
			|					Справочник.ГруппыПользователей.ПользователиГруппы.Ссылка
			|				ИЗ
			|					Справочник.ГруппыПользователей.ПользователиГруппы
			|				ГДЕ
			|					Справочник.ГруппыПользователей.ПользователиГруппы.Пользователь = &ТекущийПользователь))			
			|	И (НастройкиПравДоступаПользователей.Запись = ИСТИНА)";
			
			Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
		КонецЕсли;						
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл		
			
			Набор = РегистрыСведений.бит_ГраницыЗапретаИзмененияДанных.СоздатьНаборЗаписей();
			Набор.Отбор.Организация.Установить(Выборка.Организация);
			
			// БИТ_ЖКХ 13.02.2015{{
			// СтрокаВДереве = ДеревоДаты.Строки.Найти(Выборка.Организация, "ОрганизацияПользователь");.
			СтрокаВДереве = ДеревоЗначений.Строки.Найти(Выборка.Организация, "ОрганизацияПользователь");
			// БИТ_ЖКХ 13.02.2015}}
			
			Запись = Набор.Добавить();
			Запись.Организация = Выборка.Организация;
			Запись.Пользователь = Неопределено;
			
			Если СтрокаВДереве = Неопределено Тогда
				Запись.ГраницаЗапретаИзменений = Дата('00010101');
			Иначе
				Запись.ГраницаЗапретаИзменений = СтрокаВДереве.Граница;
				Для Каждого СтрокаРоли ИЗ СтрокаВДереве.Строки Цикл
					Запись = Набор.Добавить();
					Запись.Организация = Выборка.Организация;
					Запись.Пользователь = СтрокаРоли.ОрганизацияПользователь;
					Запись.ГраницаЗапретаИзменений = СтрокаРоли.Граница;
				КонецЦикла;
			КонецЕсли;			
			
			Набор.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
	бит_ПолныеПрава.УстановитьПараметрГраницыЗапретаИзмененияДанных();
	Модифицированность = Ложь;
	
	УстановитьМонопольныйРежим(Ложь);
	
КонецПроцедуры // СохранитьДанные

// Процедура выполняет первоначальное заполнение дерева при открытии формы.
// По данным регистра сведений "Границы запрета изменения данных".
//
&НаСервере
Процедура ЗаполнитьДеревоДат()
	
	ЭлементыДерева = ДеревоДаты.ПолучитьЭлементы();
	
	ЭлементыДерева.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация,
	|	ЕСТЬNULL(Границы.Пользователь, НЕОПРЕДЕЛЕНО) КАК Пользователь,
	|	ЕСТЬNULL(Границы.ГраницаЗапретаИзменений, ДАТАВРЕМЯ(1, 1, 1, 23, 59, 59)) КАК ГраницаЗапретаИзменений,
	|	ЕСТЬNULL(НастройкиПравДоступаПользователей.Запись, ЛОЖЬ) КАК ПравоНаИзменение,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Границы.Пользователь, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО
	|			ТОГДА 1
	|		КОГДА Границы.Пользователь ССЫЛКА Справочник.ГруппыПользователей
	|			ТОГДА 2
	|		КОГДА Границы.Пользователь ССЫЛКА Справочник.Пользователи
	|			ТОГДА 3
	|	КОНЕЦ КАК ПризнакТипаСтроки
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ГраницыЗапретаИзмененияДанных КАК Границы
	|		ПО Границы.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НастройкиПравДоступаПользователей КАК НастройкиПравДоступаПользователей
	|		ПО Организации.Ссылка = НастройкиПравДоступаПользователей.ОбъектДоступа
	|			И (НастройкиПравДоступаПользователей.ВидОбъектаДоступа = ЗНАЧЕНИЕ(Перечисление.бит_ВидыОбъектовДоступа.Организации))
	|			И (НастройкиПравДоступаПользователей.Пользователь В
	|				(ВЫБРАТЬ
	|					Справочник.ГруппыПользователей.Состав.Ссылка
	|				ИЗ
	|					Справочник.ГруппыПользователей.Состав
	|				ГДЕ
	|					Справочник.ГруппыПользователей.Состав.Пользователь = &ТекущийПользователь))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	ПризнакТипаСтроки,
	|	Границы.Пользователь
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивСтрокКРазвороту = Новый Массив;
	//АПК пункт 4 https://its.1c.ru/db/v8std/content/737/hdoc
	ЕстьРольПолныеПрава = РольДоступна("ПолныеПрава");
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Пользователь = Неопределено Тогда
			
			// БИТ_ЖКХ 30.05.2014
			// СтрокаОрганизации = ДеревоДаты.Строки.Добавить();.
			СтрокаОрганизации = ЭлементыДерева.Добавить();
			// БИТ_ЖКХ 30.05.2014
			
			СтрокаОрганизации.ОрганизацияПользователь   = Выборка.Организация;
			СтрокаОрганизации.Граница           = Выборка.ГраницаЗапретаИзменений;		
			СтрокаОрганизации.ПравоНаИзменение  = ЕстьРольПолныеПрава ИЛИ Выборка.ПравоНаИзменение;
			СтрокаОрганизации.ТипСтроки         = Выборка.ПризнакТипаСтроки;
		Иначе		
			
			Если СтрокаОрганизации = Неопределено ИЛИ СтрокаОрганизации.ОрганизацияПользователь <> Выборка.Организация Тогда
				СтрокаОрганизации = ЭлементыДерева.Добавить();
				СтрокаОрганизации.ОрганизацияПользователь   = Выборка.Организация;
				СтрокаОрганизации.ПравоНаИзменение  = ЕстьРольПолныеПрава ИЛИ Выборка.ПравоНаИзменение;
				СтрокаОрганизации.ТипСтроки         = 1;
			КонецЕсли;				
			МассивСтрокКРазвороту.Добавить(СтрокаОрганизации);		
			
			Если СпособУказанияДаты = 3 Тогда				
				СтрокаПользователя = СтрокаОрганизации.ПолучитьЭлементы().Добавить();                
				СтрокаПользователя.ОрганизацияПользователь      = Выборка.Пользователь;
				СтрокаПользователя.Граница              = Выборка.ГраницаЗапретаИзменений;
				СтрокаПользователя.ПравоНаИзменение     = ЕстьРольПолныеПрава ИЛИ Выборка.ПравоНаИзменение;
				СтрокаПользователя.ТипСтроки            = Выборка.ПризнакТипаСтроки;
			КонецЕСли;		
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ЗаполнитьДеревоДат

&НаКлиенте
Процедура СпособУказанияДатыПриИзменении(Элемент)
	
	ПриИзмененииСпособаУказания();	
	
КонецПроцедуры

// Процдура добовляет строку в дерево.
//
&НаКлиенте
Процедура ДобавитьСтрокуДерева(ТипСтроки, КорневаяСтрока, ИмяДерева, ИмяПоляПользователь = "Пользователь")
	
	Перем ВыбранноеЗначение; //
	
	// Если у пользователя нет права на редактирование данных.
	// Этой ветки - добавление в нее невозможно.
	Если Не КорневаяСтрока.ПравоНаИзменение Тогда

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("У Вас нет права редактирования данных организации " + КорневаяСтрока.ОрганизацияПользователь);
		
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Граница",КорневаяСтрока.Граница);
	ПараметрыФормы.Вставить("ОрганизацияПользователь",КорневаяСтрока.ОрганизацияПользователь);
	ПараметрыФормы.Вставить("ТипСтроки",КорневаяСтрока.ТипСтроки);
	ПараметрыФормы.Вставить("ИмяДерева",ИмяДерева);
	ПараметрыФормы.Вставить("ИмяПоляПользователь",ИмяПоляПользователь);
	
	
	Если ТипСтроки = 2 Тогда
		
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтотОбъект,ПараметрыФормы);
		ФормаВыбора = ОткрытьФорму("Справочник.ГруппыПользователей.ФормаВыбораГруппы",,,,,,Оп);
		
		Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		
		Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
		Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.НеРавно;
		Эл.ПравоеЗначение   = ПредопределенноеЗначение("Справочник.ГруппыПользователей.ВсеПользователи");
		Эл.Использование    = Истина;
		Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
	Иначе    
		
		Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияВопроса", ЭтотОбъект,ПараметрыФормы);
		
		ФормаВыбора = ОткрытьФорму("Справочник.Пользователи.ФормаВыбораГруппы",,,,,,Оп);
		
		ФормаВыбора.ТекущийЭлемент.выборГруппИЭлементов = ИспользованиеГруппИЭлементов.Элементы;
		
	КонецЕсли;    
	
КонецПроцедуры // ДобавитьСтрокуДерева

&НаКлиенте
Процедура ВыполнитьПослеЗакрытияВопроса(Результат,ПараметрыФормы) Экспорт
	
	ВыбранноеЗначение = Результат;
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;    
	
	ДеревоДатыНаСервере(ВыбранноеЗначение,ПараметрыФормы);
	
	// БИТ_ЖКХ 21.08.2014
	КоллекцияЭлементовДерева=ДеревоДаты.ПолучитьЭлементы();
	// Развернуть дерево. 
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл    
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		Элементы.ДеревоДаты.Развернуть(ИдентификаторСтроки);
	КонецЦикла;   
	// БИТ_ЖКХ 21.08.2014
	
КонецПроцедуры

&НаСервере
Процедура ДеревоДатыНаСервере(ВыбранноеЗначение,ПараметрыФормы)
	
	ДеревоЗначений = ДанныеФормыВЗначение(ДеревоДаты,тип("ДеревоЗначений"));
	
	ПервыйУровень = ДеревоЗначений.Строки.Найти(ПараметрыФормы.ОрганизацияПользователь);
	
	СуществующаяСтрока = ПервыйУровень.Строки.Найти(ВыбранноеЗначение);
	
	Если Не  СуществующаяСтрока = Неопределено Тогда     
		
		Возврат;
	КонецЕсли;  
	
	ВторойУровень = ПервыйУровень.Строки.Добавить();
	ВторойУровень[ПараметрыФормы.ИмяПоляПользователь] = ВыбранноеЗначение;
	ВторойУровень.Граница              = ПараметрыФормы.Граница;
	ВторойУровень.ТипСтроки            = ПараметрыФормы.ТипСтроки;		
	ВторойУровень.ПравоНаИзменение     = Истина;
	
	ДеревоЗначений.Строки.Сортировать("ТипСтроки, ОрганизацияПользователь");
	
	ЗначениеВДанныеФормы(ДеревоЗначений,ДеревоДаты);	
	
КонецПроцедуры

#КонецОбласти
